# DATABASE
.It is the collection of tables in which each table consist of details in it.
.Different types:-SQL, Maria db, Mango db, cussandra, oracle, H-base.

# SQL(Structured Query Language)

In [2]:
import sqlite3               # for sql
# Creating database "db=sqlite3.connect("databse_name.db")".
db=sqlite3.connect("student_database.db")

In [3]:
#(b) Declaring cursor.
cursor=db.cursor()

In [6]:
#(c) Create TABLE (PIMARY KEY is for eliminate duplicate entry and enter only unique one.)
cursor.execute("CREATE TABLE student_data1(phone_number INT PRIMARY KEY, email_id TEXT, course_name TEXT, fee_paid INT)")

In [7]:
#(d) Insert into the table (we don't have autority for this)
cursor.execute("INSERT INTO student_data1(phone_number, email_id, course_name, fee_paid) VALUES (9772018777, 'student1@gmail.com', 'Data Science', 100000)")
db.commit             #to save data permanently
print(cursor.rowcount," Record(s) Inserted")     #to count how many record inserted

1  Record(s) Inserted

In [8]:
#(e) Select query(how to fetch records from the table)
results=cursor.execute("SELECT * FROM student_data1")      # * for to select or see everthing you have in record
for row in results:
    print(row)

(9772018777, 'student1@gmail.com', 'Data Science', 100000)

In [9]:
#(f) Multiple records insertion
cursor.execute("INSERT INTO student_data1 VALUES (8504860430, 'student2@gmail.com', 'Engineering', 400000),(860430249, 'student3@gamil.com', 'Data Science', 120000)")
db.commit()
print(cursor.rowcount," Record(s) Inserted")

2  Record(s) Inserted

In [12]:
#g=(g) Load data from file into the table(keep csv in same folder where jupyter is or provide link.File didn't load directly from github)
with open('student_data1.csv','r') as file:
    no_records = 0
    for row in file:
        cursor.execute("INSERT INTO student_data1 VALUES (?,?,?,?)",row.split(","))
        db.commit()
        no_records+=1
print(no_records," Record(s) Inserted")

10  Record(s) Inserted

In [13]:
results=cursor.execute("SELECT * FROM student_data1")      #Checking for records
for row in results:
    print(row)

(9772018777, 'student1@gmail.com', 'Data Science', 100000)
(8504860430, 'student2@gmail.com', 'Engineering', 400000)
(860430249, 'student3@gamil.com', 'Data Science', 120000)
(8825365648, 'student4@gmail.com', 'Data science', 70000)
(6358986545, 'student5@gmail.com', 'Data science', 70001)
(2569784565, 'student6@gmail.com', 'Data science', 70002)
(2355684664, 'student7@gmail.com', 'Data science', 70003)
(8894523546, 'student8@gmail.com', 'Data science', 70004)
(7885648623, 'student9@gmail.com', 'Engineering', 325000)
(7985642644, 'student10@gmail.com', 'Engineering', 325001)
(9985643212, 'student11@gmail.com', 'Engineering', 325002)
(7458621356, 'student12@gmail.com', 'Engineering', 325003)
(8865489523, 'student13@gmail.com', 'Engineering', 325004)

In [15]:
#(h) Search for particular record(WHERE clause)
sql=("SELECT * FROM student_data1 WHERE course_name='Data Science'")
results=cursor.execute(sql)
for row in results:
    print(row)

(9772018777, 'student1@gmail.com', 'Data Science', 100000)
(860430249, 'student3@gamil.com', 'Data Science', 120000)

In [17]:
#(i) Delete record
sql=("DELETE FROM student_data1 WHERE phone_number=8865489523")    # enter only unqiue record entry
cursor.execute(sql)
db.commit()

In [18]:
results=cursor.execute("SELECT * FROM student_data1")      #Checking for record deleted
for row in results:
    print(row)

(9772018777, 'student1@gmail.com', 'Data Science', 100000)
(8504860430, 'student2@gmail.com', 'Engineering', 400000)
(860430249, 'student3@gamil.com', 'Data Science', 120000)
(8825365648, 'student4@gmail.com', 'Data science', 70000)
(6358986545, 'student5@gmail.com', 'Data science', 70001)
(2569784565, 'student6@gmail.com', 'Data science', 70002)
(2355684664, 'student7@gmail.com', 'Data science', 70003)
(8894523546, 'student8@gmail.com', 'Data science', 70004)
(7885648623, 'student9@gmail.com', 'Engineering', 325000)
(7985642644, 'student10@gmail.com', 'Engineering', 325001)
(9985643212, 'student11@gmail.com', 'Engineering', 325002)
(7458621356, 'student12@gmail.com', 'Engineering', 325003)

In [19]:
#(j) Order by (ascending or descending order)
results=cursor.execute("SELECT * FROM student_data1 ORDER BY fee_paid")      # records arranged in ascending order by default
for row in results:
    print(row)

(8825365648, 'student4@gmail.com', 'Data science', 70000)
(6358986545, 'student5@gmail.com', 'Data science', 70001)
(2569784565, 'student6@gmail.com', 'Data science', 70002)
(2355684664, 'student7@gmail.com', 'Data science', 70003)
(8894523546, 'student8@gmail.com', 'Data science', 70004)
(9772018777, 'student1@gmail.com', 'Data Science', 100000)
(860430249, 'student3@gamil.com', 'Data Science', 120000)
(7885648623, 'student9@gmail.com', 'Engineering', 325000)
(7985642644, 'student10@gmail.com', 'Engineering', 325001)
(9985643212, 'student11@gmail.com', 'Engineering', 325002)
(7458621356, 'student12@gmail.com', 'Engineering', 325003)
(8504860430, 'student2@gmail.com', 'Engineering', 400000)

In [20]:
results=cursor.execute("SELECT * FROM student_data1 ORDER BY fee_paid desc")      #mention'desc' for descending order
for row in results:
    print(row)

(8504860430, 'student2@gmail.com', 'Engineering', 400000)
(7458621356, 'student12@gmail.com', 'Engineering', 325003)
(9985643212, 'student11@gmail.com', 'Engineering', 325002)
(7985642644, 'student10@gmail.com', 'Engineering', 325001)
(7885648623, 'student9@gmail.com', 'Engineering', 325000)
(860430249, 'student3@gamil.com', 'Data Science', 120000)
(9772018777, 'student1@gmail.com', 'Data Science', 100000)
(8894523546, 'student8@gmail.com', 'Data science', 70004)
(2355684664, 'student7@gmail.com', 'Data science', 70003)
(2569784565, 'student6@gmail.com', 'Data science', 70002)
(6358986545, 'student5@gmail.com', 'Data science', 70001)
(8825365648, 'student4@gmail.com', 'Data science', 70000)

In [23]:
#(k) Update Table (single record update)
sql=("UPDATE student_data1 SET course_name='Engineering' WHERE phone_number=9772018777")
cursor.execute(sql)

In [24]:
results=cursor.execute("SELECT * FROM student_data1")      #Checking for record updated
for row in results:
    print(row)

(9772018777, 'student1@gmail.com', 'Engineering', 100000)
(8504860430, 'student2@gmail.com', 'Engineering', 400000)
(860430249, 'student3@gamil.com', 'Data Science', 120000)
(8825365648, 'student4@gmail.com', 'Data science', 70000)
(6358986545, 'student5@gmail.com', 'Data science', 70001)
(2569784565, 'student6@gmail.com', 'Data science', 70002)
(2355684664, 'student7@gmail.com', 'Data science', 70003)
(8894523546, 'student8@gmail.com', 'Data science', 70004)
(7885648623, 'student9@gmail.com', 'Engineering', 325000)
(7985642644, 'student10@gmail.com', 'Engineering', 325001)
(9985643212, 'student11@gmail.com', 'Engineering', 325002)
(7458621356, 'student12@gmail.com', 'Engineering', 325003)

In [28]:
#(l) Select particular column(Mulptiple conditions)
sql="SELECT phone_number, email_id, fee_paid FROM student_data1 WHERE course_name='Data Science' AND fee_paid<=120000"
results=cursor.execute(sql)
for row in results:
    print(row)

(860430249, 'student3@gamil.com', 120000)

In [31]:
#(m) Multiple records update (using 'IN')
sql="UPDATE student_data1 SET fee_paid=130000 WHERE phone_number IN(9772018777,8504860430,860430249)"
cursor.execute(sql)

In [32]:
# to verify
results=cursor.execute("SELECT phone_number, fee_paid FROM student_data1 WHERE phone_number IN(9772018777,8504860430,860430249)")
for row in results:
    print(row)

(860430249, 130000)
(8504860430, 130000)
(9772018777, 130000)

In [42]:
#(n) Update records using BETWEEN
sql="UPDATE student_data1 SET course_name='SQL' WHERE phone_number BETWEEN 9772018777 AND 6358986545"
cursor.execute(sql)
# to verify
results=cursor.execute("SELECT phone_number, course_name FROM student_data1 WHERE course_name='SQL'")
for row in results:
    print(row)

In [43]:
#(o) Min or Max
results=cursor.execute("SELECT MIN(fee_paid) FROM student_data1")     # for minimum
print("Minimum fees=",results.fetchone())

results=cursor.execute("SELECT MAX(fee_paid) FROM student_data1")     # for maximum
print("Maximum fees=",results.fetchone())

Minimum fees= (70000,)
Maximum fees= (325003,)

# Subquery
It is query within another query

In [44]:
# COURSE1 table created query1
cursor.execute("CREATE TABLE course1(courseid INT PRIMARY KEY, coursename TEXT, duration INT)")    #COURSE1 table created query1

In [48]:
# Student1 table created query2(foreign key is present in both queries and as equal as primary key)
cursor.execute("CREATE TABLE student1(roll_no INT PRIMARY KEY,studentname TEXT,age INT,courseid INT,foreign key(courseid) references course1(courseid))")

In [49]:
# Insert into the table (query1)
cursor.execute("INSERT INTO course1 VALUES (78,'data science',12),(56,'python',4),(101,'sql',7)")
db.commit()
print(cursor.rowcount,"Records Inserted")

3 Records Inserted

In [50]:
#query2
cursor.execute("INSERT INTO student1 VALUES (1,'akki',25,78),(2,'arti',26,56),(3,'priya',24,78),(4,'bharti',23,56)") 
db.commit()
print(cursor.rowcount,"Records Inserted")

4 Records Inserted

In [51]:
#chcking data query1
result=cursor.execute("SELECT * FROM course1")
for row in result:
    print(row)

(78, 'data science', 12)
(56, 'python', 4)
(101, 'sql', 7)

In [52]:
#chcking data query2
result=cursor.execute("SELECT * FROM student1")
for row in result:
    print(row)

(1, 'akki', 25, 78)
(2, 'arti', 26, 56)
(3, 'priya', 24, 78)
(4, 'bharti', 23, 56)

In [54]:
# subquery
results=cursor.execute("SELECT * FROM student1 WHERE courseid=(select courseid from course1 where coursename='data science')")
results.fetchall()

[(1, 'akki', 25, 78), (3, 'priya', 24, 78)]

In [55]:
results=cursor.execute("SELECT * FROM student1 WHERE courseid=(select courseid from course1 where coursename='python')")
results.fetchall()

[(2, 'arti', 26, 56), (4, 'bharti', 23, 56)]

# JOIN
Different types of SQL JOIN,s:
1. INNER (JOIN)-Return records that have matching values in both the tables.
2. LEFT(OUTER) JOIN-Return all records from the left table and matching records from the right table.
3. RIGHT(OUTER) JOIN-Return all records from the right table and matching records from the left table.
4. FULL(OUTER) JOIN-Return all records where there is a match in either left or right table

In [65]:
sql="DROP TABLE stud_det"     # it is used to remove the table which if it is already exist.
cursor.execute(sql)

In [66]:
# create table
cursor.execute("CREATE TABLE stud_det(phone_number INT PRIMARY KEY, student_name TEXT, enrolled_date TEXT, marks INT)")

with open('Students_details.csv','r') as file:
    no_records = 0
    for row in file:
        cursor.execute("INSERT INTO stud_det VALUES (?,?,?,?)",row.split(","))
        db.commit()
        no_records+=1
print(no_records," Record(s) Inserted")

20  Record(s) Inserted

In [67]:
results=cursor.execute("SELECT * FROM stud_det")    # to verify that records are inserted
for row in results:
    print(row)

(9988776604, 'Salah', '03-10-2020', 85)
(9988776605, 'Heung-Son', '21-06-2020', 39)
(9988776606, 'Ronaldo', '08-05-2020', 86)
(9988776607, 'Kane', '11-05-2022', 57)
(9988776608, 'Mane', '17-05-2022', 52)
(6609998877, 'Vardy', '17-12-2020', 54)
(6609998878, 'Jota', '06-11-2021', 45)
(6609998879, 'Bruyne', '26-11-2020', 49)
(6609998880, 'Zaha', '05-12-2020', 88)
(6609998881, 'Sterling', '29-10-2020', 61)
(9988776614, 'Toney', '31-03-2022', 71)
(9988776615, 'Maddison', '10-03-2020', 44)
(1687799866, 'Bowen', '14-02-2021', 96)
(1687799867, 'Saka', '19-12-2022', 92)
(1687799868, 'Watkins', '30-01-2021', 49)
(1687799869, 'Mount', '16-09-2022', 48)
(1687799870, 'Raphael', '15-05-2021', 50)
(1687799871, 'Mahrez', '30-10-2021', 72)
(9988776622, 'Pukki', '19-02-2021', 93)
(9988776623, 'Fernandes', '01-03-2022', 94)

In [ ]:
# INNER JOIN
sql="SELECT student_data.phone_number, stud_det.enrolled_date,stud_det.marks,stud_det.student_name FROM student_data INNER JOIN stud_det ON student_data.phone_number=stud_det.phone_number"
result=cursor.execute(sql)
for row in results:
    print(row)

In [ ]:
# LEFT JOIN
sql="SELECT student_data.phone_number, stud_det.enrolled_date,stud_det.marks,stud_det.student_name FROM student_data LEFT JOIN stud_det ON student_data.phone_number=stud_det.phone_number"
result=cursor.execute(sql)
for row in results:
    print(row) # RUN it

In [ ]:
#Right join and Full join is not working right now will be taken in progress soon.

# Python and SQL (how to deal with python code)

In [ ]:
# lets check for student details
while True:
    
    try:
        
        phn_num=int(input('Your mobile number '))
        
        if len(str(phn_num)) !=10:
            print('Enter 10 digit phone number')
            continue
        else:
            results=cursor.execute("SELECT * FROM stud_det")
            for detail in results:
                if detail[0]==phn_num:
                    print('Name:', detail[1])
                    print('DOJ:', detail[2])
                    print('Mark:', detail[3])
                    break
            else:
                print('Phone number not found in database')
                break
            continue
            
    except:
        print('Phone number must be numeric')
        continue

Your mobile number 9988776607
Phone number must be numeric